ALLOWED = (
    "a b c d e f g h i j k l m n o p q r s t u v w x y z "
    "č ḍ ǧ ḥ ɣ ṛ ṣ ṭ ɛ ẓ "
    "A B C D E F G H I J K L M N O P Q R S T U V W X Y Z "
    "Č Ḍ Ǧ Ḥ Ɣ Ṛ Ṣ Ṭ Ɛ Ẓ"
)
ALLOWED_SET = set(ALLOWED.split())

DEFAULT_MAPPING = { 
    
    "γ": "ɣ", "Γ": "Ɣ", "ğ": "ǧ", "ş": "ṣ", "ţ": "ṭ", "ḅ": "ḍ",
    "ε": "ɛ", "ϵ": "ɛ", "Σ": "Ɛ", "Ԑ": "Ɛ", "Г": "Ɣ", "£": "ɣ",
    "þ": "ẓ", "þþ": "ẓẓ", "ç": "č", "ã": "ǧ", "õ": "ṭ", "ĝ": "ǧ",
    " ": "- ", "žž": "zz", "ž": "zz",
    
    "ţţ": "ṭṭ", "țț": "ṭṭ", "îî": "ṭṭ", "ôô": "ṭṭ", "éé": "ẓẓ",
    "ûû": "ṣṣ", "ââ": "ɛɛ", "$$": "ɣɣ", "ee$": "eɣɣ", "aa$": "aɣɣ",
    "ii$": "iɣɣ", "$i": "ɣi", "$e": "ɣe", "$a": "ɣa",
    
    "e$": "eɣ", "a$": "aɣ", "i$": "iɣ", "$$": "ɣ", "s÷": "sɣ",
    "e÷": "eɣ", "f$": "fɣ", "u$": "uɣ", "d$a": "dɣa", "b$a": "bɣa",
    
    "v-d": "ḍ-d", "ruê": "ruḥ", "veâ": "ḍeɛ", "sâe": "sɛe",
    "êin": "ḥin", "cêal": "cḥal", "êku": "ḥku", "êiɣ": "ḥiɣ",
    "êal": "ḥal", "êan": "ḥan", "êu": "ḥu", "êeb": "ḥeb",
    "êer": "ḥer", "êas": "ḥas", "êut": "ḥut", "êuq": "ḥuq",
    "êya": "ḥya", "êif": "ḥif", "êic": "ḥic", "êidd": "ḥidd",
    "êawed": "ḥawed", "êadd": "ḥadd", "êemm": "ḥemm", "açamar": "ačamar",
    
    "Ğ": "Ǧ", "Ç": "Č", "Â": "Ɛ", "Ê": "Ḥ", "Î": "Ṭ", "Ô": "Ṛ",
    "Û": "Ṣ", "É": "Ẓ", "Ä": "Ɛ", "Ö": "Ṛ", "Ï": "Ṭ",
}

_REV_SORTED = sorted(DEFAULT_MAPPING, key=len, reverse=True)
